/*! Функция интерфейса */

#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>

#include "interface.h"

// Функция для обработки коэффициентов уравнения из командной строки
int
ParseArgs(int argc, char *argv[], char **log_file, int *timeout, double *a,
          double *b, double *c,
          double *d) {
    // Объявляем переменную для хранения кода возврата функции getopt
    int opt;

    // Проверяем количество аргументов командной строки

    // Проверяем, что аргументов 7, 9, 11, 13
    if (argc != 7 && argc != 9 && argc != 11 && argc != 13) {
        fprintf(stderr,
                "Использование: ./client [-l log_file] [-t timeout] "
                "-a a -b b -c c [-d d]\n");
        return -1;
    }

    // Объявляем указатели на конец чисел
    char *endptrA;
    char *endptrB;
    char *endptrC;
    char *endptrD;

    // Объявляем переменные-флаги для проверки повторения опций
    int aFlag = 0;
    int bFlag = 0;
    int cFlag = 0;
    int dFlag = 0;

    // Используем цикл while для анализа аргументов командной строки
    //  strtod() преобразует строку в число с плавающей точкой и возвращает
    //  указатель на первый символ, который не является частью числа.
    //  Если этот символ не равен нулевому символу ‘\0’, то это означает,
    //  что строка содержит неверный формат числа.
    while ((opt = getopt(argc, argv, "a:b:c:d:t:l:")) != -1) {
        switch (opt) {
            case 'l':
                // Имя файла журнала
                *log_file = optarg;
                break;
            case 't':
                // Время ожидания ввода пользователя
                *timeout = atoi(optarg);
                break;
            case 'a':
                // Проверяем флаг a
                if (aFlag == 1) {
                    // Опция a повторяется
                    fprintf(stderr,
                            "Опция -a не может быть указана более одного раза.\n");
                    return -1;
                } else {
                    // Опция a встречается в первый раз
                    aFlag = 1; // Устанавливаем флаг a в 1
                }
                // Преобразуем строку в число с плавающей точкой и сохраняем в указателе a
                *a = strtod(optarg,
                            &endptrA); // Присваиваем значение и адрес конца числа
                if (*endptrA !=
                    '\0') {
                    // Проверяем, что строка заканчивается нулевым символом
                    fprintf(stderr, "Неверный формат числа для опции -a.\n");
                    return -1;
                }
                break;
            case 'b':
                // Проверяем флаг b
                if (bFlag == 1) {
                    // Опция b повторяется
                    fprintf(stderr,
                            "Опция -b не может быть указана более одного раза.\n");
                    return -1;
                } else {
                    // Опция b встречается в первый раз
                    bFlag = 1; // Устанавливаем флаг b в 1
                }
                // Преобразуем строку в число с плавающей точкой и сохраняем в указателе b

                *b = strtod(optarg,
                            &endptrB); // Присваиваем значение и адрес конца числа
                if (*endptrB !=
                    '\0') {
                    // Проверяем, что строка заканчивается нулевым символом
                    fprintf(stderr, "Неверный формат числа для опции -b.\n");
                    return -1;
                }
                break;
            case 'c':
                // Проверяем флаг c
                if (cFlag == 1) {
                    // Опция c повторяется
                    fprintf(stderr,
                            "Опция -c не может быть указана более одного раза.\n");
                    return -1;
                } else {
                    // Опция c встречается в первый раз
                    cFlag = 1; // Устанавливаем флаг c в 1
                }
                // Преобразуем строку в число с плавающей точкой и сохраняем в указателе c

                *c = strtod(optarg,
                            &endptrC); // Присваиваем значение и адрес конца числа
                if (*endptrC !=
                    '\0') {
                    // Проверяем, что строка заканчивается нулевым символом
                    fprintf(stderr, "Неверный формат числа для опции -c.\n");
                    return -1;
                }
                break;
            case 'd': // Добавляем опцию -d для четвертого коэффициента
                // Проверяем флаг d
                if (dFlag == 1) {
                    // Опция d повторяется
                    fprintf(stderr,
                            "Опция -d не может быть указана более одного раза.\n");
                    return -1;
                } else {
                    // Опция d встречается в первый раз
                    dFlag = 1; // Устанавливаем флаг d в 1
                }
                // Преобразуем строку в число с плавающей точкой и сохраняем в указателе d
                *d = strtod(optarg,
                            &endptrD); // Присваиваем значение и адрес конца числа
                if (*endptrD !=
                    '\0') {
                    // Проверяем, что строка заканчивается нулевым символом
                    fprintf(stderr,
                            "Неверный формат числа для опции -d.\n");
                    return -1;
                }
                break;
            default:
                fprintf(stderr,
                        "Использование: ./client [-l log_file] "
                        "[-t timeout] -a a -b b -c c [-d d]\n");
                return -1;
        }
    }

    // Проверяем, что коэффициенты уравнения не равны нулю или единице
    if (*a == 0 || *a == 1 || *b == 0 || *b == 1 || *c == 0 || *c == 1) {
        fprintf(stderr, "Неверные коэффициенты.\n");
        return -1;
    }

    // Возвращаем код успеха
    return 0;
}